Revit 2024 API
ParameterTypeId.HostPerimeterComputed Property
 "Perimeter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId HostPerimeterComputed { get; }
Visual Basic
Public Shared ReadOnly Property HostPerimeterComputed As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ HostPerimeterComputed {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace